//LIST | STL C++ | Библиотека стандартных шаблонов (stl) | Уроки | C++ | #3 - Видео №158.

#include<iostream>
#include<list>
#include<vector>
#include<string>
using namespace std;

//-----------------------------------------------------------------------------------------
template <typename T>
void PrintList(const list<T> &lst)
{
}
//-----------------------------------------------------------------------------------------
int main()
{
	setlocale(LC_ALL,"Ru");



	return 0;
}
//-----------------------------------------------------------------------------------------