//Что такое ООП простыми словами. Объектно ориентированное программирование это. Урок #72 - Видео №85 (Теория)

/*Данный материал разбиваеться на три смысла*/

/*
- ИНКАПСУЛЯЦИЯ
- НАСЛЕДИЕ
- ПОЛИМОРФИЗМ
*/

/*
- ИНКАПСУЛЯЦИЯ
На пример из быта возмём обычную кофемолку.
На её примере что такое - ИНКАПСУЛЯЦИЯ - это когда у нас есть ограниченный интерфейс, где мы можем нажать кнопку
пуск, заспать зёрна, и получить кофе. А то что в нутри кофе машины находиться и как она работает, нас не касаеться.
В нутри неё уже всё до нас настроили, скорость, давление, провода и так далее, то что от нас скрыто.
По другому, один програмист создал функцию, для опеределённых действий, и передал её другому.
Другой програмист знает, что данная функция выполняет определённые действия, как она написана и что конкретной в ней, 
нас не интересует, мы просто знаем что она работает и она нам нужна.
*/

/*
- НАСЛЕДИЕ
Есть и более современные атоматическме кофе машины, которые могут разный объём делать кофе, под разной скоростью,
с более расширенным функцианалом, но суть остаёться одна, всё также делает кофе!
Если с точки зрения програмирования, это дополнение к имеющейся функции более универсальный тип её реализации и 
дополнения данной функции.
*/

/*
- ПОЛИМОРФИЗМ
Есть автоматическая кофемолка, а есть ручная, но суть одна, обе делают кофе.
С точки зрения програмирования, на примере создания юнитов в игре - 
Один стреляет пистолетом, под него написана одна функция.
А есть юнит который начинает стрелять автоматом, и ещё и при этом присидает. 
Мы приминяем принцип действия функции для юнита который в принципе стреляет, итог один, но везде подправляем под 
конкретные задачи действия юнитов, но повторюсь сама по себе функция роль выполняет одну.
*/





