//Что такое динамическая память. Утечка памяти. Стек и куча. Статическая память. Обзорный урок #45

#include<iostream>
using namespace std;

/*Теория. При работе с динамической памятью, в языке с++, её необходимо чистить, если нам данные которые в ней
(в куче) больше нам ненужны, в противном случаи память забъётся данными и станет нехватка места. Язык с++
низкоуровневый, это значит что у него более жёские рычаги работы и контроля над памятью, где вероятность
ошибки есть допустить больше.*/

void main()
{
	setlocale(LC_ALL, "ru");
	


}